app/controllers/sessions_controller.rb

  def create
    auth = request.env['omniauth.auth']
    user = User.create_with_oauth(auth)
---
INSERT INTO "users" ("name", "provider", "uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ItinoseSan"], ["provider", "github"], ["uid", "24353841"], ["created_at", "2017-11-12 06:28:05.078569"], ["updated_at", "2017-11-12 06:28:05.078569"]]